Tekla Open API Reference for Tekla Structures 2025
AngleList Class
 This class provides methods to handle lists of angles
Inheritance Hierarchy
System.Object
 Tekla.Structures.Datatype.AngleList
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class AngleList
Public NotInheritable Class AngleList
Methods
Name | Description
Parse(String)
 Parses the given text as an angle list in the current unit type
Parse(String, IFormatProvider)
 Parses the given text as an angle list in the current unit type
Parse(String, IFormatProvider, Angle.UnitType)
 Parses the given text as an angle list in the current unit type
ToString(IEnumerable<Angle>)
 Converts the given angles to a string in the current units
ToString(IEnumerable<Angle>, Angle.UnitType)
 Converts the given angles to a string in the given units
ToString(IEnumerable<Angle>, String, IFormatProvider)
 Converts the given angles to a string with the given parameters in the current unit
ToString(IEnumerable<Angle>, String, IFormatProvider, Angle.UnitType)
 Converts the given angles to a string with the given parameters in the current unit
Top
See Also
Reference
Tekla.Structures.Datatype Namespace